import React, {useState} from 'react';
import Overlay from "../../../components/Overlay/Overlay";
import overlayImage from '../../../assets/overlay/test-drive.png'
import rent from '../../../assets/overlay/rent.png'

const FirstScreen = () => {

    const [status, setStatus] = useState(1)
    const [overlay, setOverlay] = useState(false)

    return (
        <section className="home">
            {overlay && status === 2 && <Overlay image={overlayImage} title={'Запись на тест драйв'} setOverlay={setOverlay}/>}
            {overlay && status === 3 && <Overlay image={rent} title={'Аренда авто'} setOverlay={setOverlay}/>}
            <div className="container">
                <div className="home__text">
                    <h2 className="home__title">Электромобили в Липецке <br/> в наличии</h2>
                    <p className="home__subtitle">Узнайте, как использовать самый экологичный <br/> автомобиль в
                        повседневной
                        жизни
                    </p>
                    <div className="home__btns">
                        <button onClick={() => {
                            setStatus(2)
                            setOverlay(true)
                        }} className="btn btn_green btn_test" type="button">Тест драйв</button>
                        <button onClick={() => {
                            setStatus(3)
                            setOverlay(true)
                        }} className="btn btn_red btn_rent" type="button">Аренда электромобиля</button>
                    </div>
                </div>
                <div className="home__row">
                    <div className="home__card">
                    <span className="home__card-icon">
                        <svg width="65" height="65" viewBox="0 0 65 65" fill="none" xmlns="http://www.w3.org/2000/svg">
<path
    d="M55.617 34.6989H50.5901C51.1025 36.1017 51.3825 37.6157 51.3825 39.1936V58.1921C51.3825 58.85 51.268 59.4815 51.0596 60.0688H59.3701C62.4745 60.0688 65 57.5431 65 54.4389V44.0819C65.0001 38.9082 60.7909 34.6989 55.617 34.6989Z"
    fill="white"/>
<path
    d="M13.6177 39.1937C13.6177 37.6157 13.8976 36.1019 14.41 34.699H9.38312C4.20927 34.699 0 38.9083 0 44.0822V54.4391C0 57.5434 2.52548 60.069 5.62987 60.069H13.9405C13.7322 59.4815 13.6177 58.8501 13.6177 58.1923V39.1937Z"
    fill="white"/>
<path
    d="M38.2461 29.8105H26.754C21.5802 29.8105 17.3709 34.0198 17.3709 39.1937V58.1922C17.3709 59.2286 18.2111 60.0689 19.2475 60.0689H45.7526C46.789 60.0689 47.6292 59.2287 47.6292 58.1922V39.1937C47.6292 34.0198 43.42 29.8105 38.2461 29.8105Z"
    fill="white"/>
<path
    d="M32.5 4.93088C26.2778 4.93088 21.2157 9.99302 21.2157 16.2154C21.2157 20.4359 23.5451 24.122 26.9853 26.0573C28.617 26.9752 30.4982 27.4998 32.5 27.4998C34.5018 27.4998 36.383 26.9752 38.0148 26.0573C41.4551 24.122 43.7844 20.4358 43.7844 16.2154C43.7844 9.99314 38.7223 4.93088 32.5 4.93088Z"
    fill="white"/>
<path
    d="M12.6849 15.4488C8.03145 15.4488 4.2457 19.2346 4.2457 23.888C4.2457 28.5415 8.03145 32.3273 12.6849 32.3273C13.8653 32.3273 14.9894 32.0828 16.0105 31.6432C17.7759 30.8832 19.2315 29.5377 20.1323 27.8524C20.7645 26.6696 21.1241 25.3202 21.1241 23.888C21.1241 19.2347 17.3384 15.4488 12.6849 15.4488Z"
    fill="white"/>
<path
    d="M52.3152 15.4488C47.6617 15.4488 43.876 19.2346 43.876 23.888C43.876 25.3203 44.2356 26.6697 44.8679 27.8524C45.7686 29.5379 47.2242 30.8833 48.9897 31.6432C50.0107 32.0828 51.1348 32.3273 52.3152 32.3273C56.9687 32.3273 60.7544 28.5415 60.7544 23.888C60.7544 19.2346 56.9687 15.4488 52.3152 15.4488Z"
    fill="white"/>
</svg>
                    </span>
                        <p className="home__card-text">Приобщись к сообществу <br/>
                            любителей современных <br/>
                            экологичных автомобилей</p>
                    </div>
                    <div className="home__card">
                    <span className="home__card-icon">
                        <svg width="55" height="55" viewBox="0 0 55 55" fill="none" xmlns="http://www.w3.org/2000/svg">
<path
    d="M14.6094 19.3359C10.1672 19.3359 6.44531 22.9504 6.44531 27.3926C6.44531 31.8348 10.1672 35.4492 14.6094 35.4492C19.0516 35.4492 22.7734 31.8348 22.7734 27.3926C22.7734 22.9504 19.0516 19.3359 14.6094 19.3359Z"
    fill="white"/>
<path
    d="M40.498 0C32.5012 0 25.9961 6.50515 25.9961 14.502C25.9961 16.9961 26.6334 19.4304 27.8434 21.5893L26.0795 26.8828C25.8922 27.4413 26.026 28.055 26.4257 28.4877C26.8358 28.9313 27.4483 29.0958 27.9977 28.9551L33.9819 27.4603C35.993 28.4721 38.2321 29.0039 40.498 29.0039C48.4949 29.0039 55 22.4988 55 14.502C55 6.50515 48.4949 0 40.498 0ZM42.1094 20.9473C42.1094 21.8379 41.3887 22.5586 40.498 22.5586C39.6074 22.5586 38.8867 21.8379 38.8867 20.9473V14.502C38.8867 13.6113 39.6074 12.8906 40.498 12.8906C41.3887 12.8906 42.1094 13.6113 42.1094 14.502V20.9473ZM40.498 11.2793C39.6082 11.2793 38.8867 10.5579 38.8867 9.66797C38.8867 8.77809 39.6082 8.05664 40.498 8.05664C41.3879 8.05664 42.1094 8.77809 42.1094 9.66797C42.1094 10.5579 41.3879 11.2793 40.498 11.2793Z"
    fill="white"/>
<path
    d="M23.0646 34.9087C20.9985 37.2014 17.9308 38.6719 14.6094 38.6719C11.288 38.6719 8.22024 37.2014 6.1542 34.9087C2.44353 37.5379 0 41.8446 0 46.7285V53.3887C0 54.2793 0.720693 55 1.61133 55H27.6074C28.4981 55 29.2188 54.2793 29.2188 53.3887V46.7285C29.2188 41.8446 26.7752 37.5379 23.0646 34.9087Z"
    fill="white"/>
</svg>
                    </span>
                        <p className="home__card-text">Полезная информация <br/> об электромобилях</p>
                    </div>
                    <div className="home__card">
                    <span className="home__card-icon">
                        <svg width="37" height="55" viewBox="0 0 37 55" fill="none" xmlns="http://www.w3.org/2000/svg">
<path
    d="M32.028 5.8212H28.745V2.9728C28.745 1.3336 27.4114 0 25.7722 0H11.2277C9.5885 0 8.25489 1.3336 8.25489 2.9728V5.8212H4.97203C2.51322 5.8212 0.512817 7.8216 0.512817 10.2804V50.5408C0.512817 52.9996 2.51322 55 4.97203 55H32.028C34.4868 55 36.4872 52.9996 36.4872 50.5408V10.2804C36.4872 7.8216 34.4868 5.8212 32.028 5.8212ZM14.4434 48.4598L17.1035 35.8233C17.125 35.7202 17.099 35.6127 17.0318 35.5292C16.9674 35.4514 16.8646 35.4021 16.7605 35.4021H12.0587L22.5088 19.5596L19.8609 31.4722C19.8381 31.5755 19.8631 31.6822 19.9295 31.7641C19.9981 31.8503 20.0971 31.8977 20.2038 31.8977H24.9228L14.4434 48.4598ZM32.028 14.0881H4.97203V10.2804H32.028V14.0881Z"
    fill="white"/>
</svg>
                    </span>
                        <p className="home__card-text">Развитая сеть зарядных <br/> устройств</p>
                    </div>
                </div>
            </div>
        </section>
    );
};

export default FirstScreen;